[
  {
    "id": 1,
    "title": "Spotify",
    "companyName": "Spotify AB",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111624.png",
    "description": "Spotify is your ultimate destination for music, podcasts, and audio experiences that move with your mood. From trending chart-toppers to timeless classics, Spotify lets you stream millions of songs from artists all over the world. Discover playlists created by experts, or make your own to match any moment — whether you're studying, relaxing, working out, or on a road trip.With personalized recommendations powered by intelligent algorithms, Spotify learns your taste and curates a soundtrack made just for you. Dive into podcasts across every genre, from true crime to comedy, motivation, and education. You can download your favorite songs for offline listening, create collaborative playlists with friends, and even explore live sessions and artist radios. With Spotify Premium, you get an ad-free experience, high-quality sound, and unlimited skips, giving you complete control over how you listen. Connect with your favorite artists, follow their new releases instantly, and share what you love on social media. Whether on your phone, desktop, or smart device, Spotify keeps your music flowing seamlessly wherever you are. Rediscover music that defined your memories and find new artists who'll inspire the next ones. More than just a streaming platform, Spotify is a global community where music, technology, and creativity meet to make every beat count.",

    "size": 45,
    "reviews": 320000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 120000
      },
      {
        "name": "2 star",
        "count": 150000
      },
      {
        "name": "3 star",
        "count": 600000
      },
      {
        "name": "4 star",
        "count": 3000000
      },
      {
        "name": "5 star",
        "count": 28000000
      }
    ]
  },
  {
    "id": 2,
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111463.png",
    "description": "Capture and share your moments through photos, stories, and reels with friends and followers. This app lets you express yourself visually — from candid snapshots to curated photo galleries and creative video reels. Designed for a global community of creators, influencers, and everyday users, it makes sharing your world simple and inspiring. You can post photos, short videos, and ephemeral stories that disappear after 24 hours, keeping your feed dynamic and authentic. The built-in editing tools and filters help you enhance your visuals instantly, while reels let you explore music, trends, and creative effects that make every post stand out. Stay connected through likes, comments, and direct messages, and build real connections with people who share your passions. For creators and brands, powerful insights and analytics reveal how your content performs, helping you grow your audience and engagement. The Explore page lets you discover new ideas, trending content, and inspiring creators from around the world. Privacy options let you control who sees your posts, and secure login keeps your account protected. You can also shop directly from your favorite brands and follow influencers for product recommendations. Whether you're documenting your daily life, showcasing your art, or following global trends, this app gives you a platform to tell your story your way. It's more than just a photo-sharing app — it's a space to connect, inspire, and create memories that last forever.",
    "size": 55,
    "reviews": 890000,
    "ratingAvg": 4.4,
    "downloads": 3500000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 1200000
      },
      {
        "name": "2 star",
        "count": 2400000
      },
      {
        "name": "3 star",
        "count": 5600000
      },
      {
        "name": "4 star",
        "count": 16000000
      },
      {
        "name": "5 star",
        "count": 64000000
      }
    ]
  },
  {
    "id": 3,
    "title": "YouTube",
    "companyName": "Google LLC",
    "image": "https://cdn-icons-png.flaticon.com/512/1384/1384060.png",
    "description": "Watch, upload, and share videos with the largest video-sharing community. This app empowers creators and viewers alike to connect through the power of video. Explore millions of videos across every category — from music, vlogs, and tutorials to gaming, technology, and lifestyle content. Whether you're learning a new skill, catching up on trending news, or discovering independent creators, the platform delivers endless entertainment tailored to your interests. Advanced recommendations analyze your watch history to serve up videos you'll love, making every session uniquely personal. For creators, powerful upload tools let you share your stories in high quality, with options to add thumbnails, captions, tags, and monetization features to grow your audience and earn from your content. Interact with your community through comments, likes, shares, and live streams, building genuine connections in real time. Offline downloads ensure you can enjoy your favorite videos even without an internet connection. The app supports seamless playback on phones, tablets, and smart TVs, allowing you to continue watching from where you left off. With live notifications, you'll never miss a new upload from your favorite channels. Its intuitive interface and lightning-fast performance make browsing effortless, while robust privacy and safety tools protect both creators and viewers. Whether you're here to watch, learn, or share your creativity, this app turns your ideas into moments that inspire the world.",
    "size": 70,
    "reviews": 1050000,
    "ratingAvg": 4.5,
    "downloads": 6000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 2500000
      },
      {
        "name": "2 star",
        "count": 3700000
      },
      {
        "name": "3 star",
        "count": 9000000
      },
      {
        "name": "4 star",
        "count": 21000000
      },
      {
        "name": "5 star",
        "count": 69000000
      }
    ]
  },
  {
    "id": 4,
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/5977/5977590.png",
    "description": "Stream unlimited movies, series, and documentaries from anywhere, anytime. This streaming platform brings entertainment to your fingertips with thousands of titles across every genre — from action-packed thrillers and heartwarming dramas to laugh-out-loud comedies and thought-provoking documentaries. With an ever-growing library, you'll never run out of content to explore. Personalized recommendations ensure that every user discovers new favorites based on their viewing habits, while trending lists keep you updated on what's popular worldwide. Watch in high definition with seamless playback and adaptive streaming that adjusts automatically to your internet speed. Whether you're relaxing at home or traveling, you can download your favorite shows for offline viewing and continue watching exactly where you left off. Multiple user profiles let families enjoy separate experiences with custom watchlists and parental controls for kids. The sleek, intuitive interface makes browsing effortless, and smart search helps you find exactly what you're looking for in seconds. Subtitles and dubbing options in multiple languages make global content accessible to everyone. Subscribers can enjoy ad-free streaming and exclusive originals produced by top creators and studios around the world. With cross-platform compatibility, you can switch between your phone, tablet, laptop, or smart TV without missing a moment. From blockbuster hits to indie gems, this app transforms how you experience entertainment — unlimited, convenient, and tailored to your taste. Dive into your next story today.",
    "size": 80,
    "reviews": 550000,
    "ratingAvg": 4.3,
    "downloads": 900000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 3000000
      },
      {
        "name": "3 star",
        "count": 6000000
      },
      {
        "name": "4 star",
        "count": 12000000
      },
      {
        "name": "5 star",
        "count": 32000000
      }
    ]
  },
  {
    "id": 5,
    "title": "Canva",
    "companyName": "Canva Pty Ltd",
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968705.png",
    "description": "Create beautiful designs, presentations, and social media posts easily with Canva. This all-in-one design platform empowers anyone — from beginners to professionals — to bring their creative ideas to life without needing advanced design skills. With a vast collection of customizable templates, fonts, and graphics, you can design anything in minutes, whether it's a business presentation, Instagram post, logo, resume, or marketing flyer. The intuitive drag-and-drop interface makes the entire process effortless, allowing you to focus on creativity rather than technical complexity. Collaboration is seamless, too — teams can work together in real time, share feedback, and finalize designs faster. Canva also offers a library of millions of stock photos, videos, icons, and illustrations that help your content stand out beautifully. You can instantly resize designs for multiple platforms, maintain brand consistency using brand kits, and export in high-quality formats like PNG, PDF, or MP4. For those on the go, the mobile app ensures your creativity never stops — design anytime, anywhere. Whether you're a student, entrepreneur, marketer, or social media creator, Canva adapts to your needs and helps you design with confidence. Its AI-powered tools, such as Magic Resize and Background Remover, make professional-quality editing faster than ever. With Canva, you're not just designing visuals — you're communicating ideas, telling stories, and building your brand with style. Unlock your creativity and transform the way you design today.",
    "size": 40,
    "reviews": 125000,
    "ratingAvg": 4.8,
    "downloads": 100000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 50000
      },
      {
        "name": "2 star",
        "count": 120000
      },
      {
        "name": "3 star",
        "count": 350000
      },
      {
        "name": "4 star",
        "count": 2100000
      },
      {
        "name": "5 star",
        "count": 10000000
      }
    ]
  },
  {
    "id": 6,
    "title": "Notion",
    "companyName": "Notion Labs Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968908.png",
    "description": "Organize your work and life with an all-in-one workspace for notes, tasks, and projects. This productivity app is designed to help individuals and teams bring clarity and structure to everything they do. You can create pages for your daily notes, design to-do lists, plan projects, track goals, and even build custom dashboards — all within a single, flexible platform. With its simple yet powerful interface, users can easily drag, drop, and rearrange content, making organization feel effortless and intuitive. Collaboration is at the heart of this workspace. Team members can edit documents together in real time, comment, tag others, and stay aligned on every project. Built-in templates for project management, meeting notes, design planning, and personal journals make it easy to get started instantly. The app also supports rich content such as images, files, links, and embedded media, allowing users to create beautiful, functional pages that fit their workflow. Powerful search and filters help you find anything in seconds, while cloud sync keeps all your data accessible across devices. You can integrate with popular tools like Google Drive, Slack, or Trello to streamline your work even further. Whether you;re managing a business, studying, or simply organizing your daily routine, this app adapts to your style. Stay focused, keep your ideas structured, and make progress on what matters most. Simplify your digital life and take control of your productivity — all in one connected workspace.",
    "size": 35,
    "reviews": 62000,
    "ratingAvg": 4.7,
    "downloads": 10000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 40000
      },
      {
        "name": "2 star",
        "count": 80000
      },
      {
        "name": "3 star",
        "count": 200000
      },
      {
        "name": "4 star",
        "count": 1500000
      },
      {
        "name": "5 star",
        "count": 4400000
      }
    ]
  },
  {
    "id": 7,
    "title": "Uber",
    "companyName": "Uber Technologies Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/888/888857.png",
    "description": "Book rides and get to your destination safely with Uber's trusted drivers. This app makes transportation fast, reliable, and effortless for millions of users worldwide. Whether you need a quick trip across town, a ride to the airport, or a comfortable commute to work, the Uber app connects you instantly with nearby drivers in just a few taps. You can choose from multiple ride options — from budget-friendly cars to premium experiences — depending on your needs and preferences. Real-time GPS tracking ensures you always know where your driver is and how long it will take to arrive. The in-app fare estimate and transparent pricing help you plan your trip with confidence. Safety is built into every ride, with verified drivers, live location sharing, and 24/7 support available whenever you need it. You can rate your driver, provide feedback, and even contact support directly within the app for a secure and trustworthy experience. Uber also allows you to save favorite destinations, schedule rides in advance, and pay effortlessly using credit cards, mobile wallets, or cash depending on your location. The app is optimized for speed, accuracy, and global availability, operating in thousands of cities across continents. Whether you're traveling for business, meeting friends, or exploring new places, Uber provides comfort and convenience at your fingertips. With continuous innovation, safety enhancements, and eco-friendly ride options like electric vehicles, Uber is redefining urban mobility one trip at a time. Get moving faster, smarter, and safer — anywhere, anytime.",
    "size": 60,
    "reviews": 280000,
    "ratingAvg": 4.5,
    "downloads": 90000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 800000
      },
      {
        "name": "2 star",
        "count": 1000000
      },
      {
        "name": "3 star",
        "count": 2000000
      },
      {
        "name": "4 star",
        "count": 6000000
      },
      {
        "name": "5 star",
        "count": 18000000
      }
    ]
  },
  {
    "id": 8,
    "title": "Duolingo",
    "companyName": "Duolingo Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968897.png",
    "description": "Learn new languages with fun and interactive lessons that feel like games. This app transforms language learning into an enjoyable daily habit, making it perfect for beginners and advanced learners alike. With bite-sized lessons designed by linguistic experts, users can quickly grasp vocabulary, grammar, pronunciation, and conversational phrases in over 30 different languages — including Spanish, French, German, Korean, and Japanese. Each lesson combines reading, writing, speaking, and listening exercises to create a well-rounded learning experience. The app's gamified approach keeps you motivated through points, levels, streaks, and leaderboards, rewarding consistency and progress. Intelligent algorithms personalize lessons based on your learning pace and areas that need improvement. You can track your growth over time and revisit weak spots to strengthen your skills. The friendly interface and colorful visuals make learning intuitive and stress-free, even for children. The app also offers pronunciation practice powered by speech recognition, helping you sound more natural and confident. Offline mode allows you to continue lessons anywhere without internet access. Whether you're preparing for travel, studying abroad, or learning just for fun, this app adapts to your goals and schedule. It turns the challenge of learning a new language into an exciting adventure filled with achievements, daily goals, and community support. Start speaking a new language today — one fun lesson at a time.",
    "size": 35,
    "reviews": 180000,
    "ratingAvg": 4.8,
    "downloads": 50000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 200000
      },
      {
        "name": "2 star",
        "count": 300000
      },
      {
        "name": "3 star",
        "count": 900000
      },
      {
        "name": "4 star",
        "count": 4000000
      },
      {
        "name": "5 star",
        "count": 12600000
      }
    ]
  },
  {
    "id": 9,
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/733/733558.png",
    "description": "Discover new ideas and save inspirations for design, recipes, fashion, travel, and much more — all in one creative platform made to spark your imagination. This app lets users explore millions of visual ideas shared by people from around the world. Whether you're decorating your home, planning your next trip, cooking something special, or designing a brand identity, you can find endless inspiration tailored to your interests. The personalized feed adapts to your taste, showing you pins, images, and videos that match your favorite topics. You can organize your discoveries by creating boards and collections, keeping everything neat and easy to revisit later. Each idea can be saved, shared, or turned into action with step-by-step guides and helpful links provided by creators. With powerful search and category filters, users can explore everything from minimal design concepts to bold DIY projects. The app also allows you to follow creators and brands, ensuring your feed is always fresh and inspiring. Collaboration features make it easy to plan group projects — whether it's event decor, mood boards, or creative campaigns. With offline saving, you can keep your favorite ideas even without an internet connection. Designed for dreamers, creators, and planners, this app encourages you to think visually and transform inspiration into real results. Whether you're a designer, chef, traveler, or simply someone who loves beautiful ideas, it's your go-to space for creativity and discovery every day.",
    "size": 50,
    "reviews": 150000,
    "ratingAvg": 4.7,
    "downloads": 100000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 150000
      },
      {
        "name": "2 star",
        "count": 250000
      },
      {
        "name": "3 star",
        "count": 800000
      },
      {
        "name": "4 star",
        "count": 3200000
      },
      {
        "name": "5 star",
        "count": 10800000
      }
    ]
  },
  {
    "id": 10,
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "image": "https://cdn-icons-png.flaticon.com/512/3046/3046120.png",
    "description": "Create and discover short videos with trending music and effects in a global community that celebrates creativity, self-expression, and entertainment. This app empowers anyone to become a creator, whether you're showcasing your talent, sharing everyday moments, or joining viral challenges. With an intuitive interface and powerful editing tools, users can easily record, trim, and enhance clips using filters, AR effects, transitions, and a massive library of popular songs. The built-in music collection features trending hits, local favorites, and emerging artists, allowing creators to sync visuals perfectly with sound. You can explore an endless feed of personalized content curated by advanced algorithms that learn your interests and show you what you love most. From dance trends and comedy skits to tutorials, gaming clips, and lifestyle vlogs — there's always something new to discover. Social features like likes, comments, shares, and duets make it easy to connect with other creators and grow your audience worldwide. The app also supports live streaming, giving users the chance to engage directly with followers in real time. Privacy and safety are top priorities, with tools that let you manage who can view or interact with your videos. Lightweight performance ensures smooth playback even on slower networks, while offline saving lets you download favorites for later viewing. Whether you're a professional influencer, aspiring artist, or casual user, this app turns every second into an opportunity to inspire, entertain, and be seen by millions around the world.",
    "size": 75,
    "reviews": 900000,
    "ratingAvg": 4.4,
    "downloads": 300000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 3500000
      },
      {
        "name": "3 star",
        "count": 7000000
      },
      {
        "name": "4 star",
        "count": 15000000
      },
      {
        "name": "5 star",
        "count": 62500000
      }
    ]
  },
  {
    "id": 11,
    "title": "Telegram",
    "companyName": "Telegram FZ LLC",
    "image": "https://cdn-icons-png.flaticon.com/512/906/906377.png",
    "description": "Fast, secure, and cloud-based messaging app for everyone who values privacy, speed, and reliability. This app allows you to send text messages, photos, videos, voice notes, and files of any type instantly across all your devices — mobile, tablet, or desktop. Built on powerful cloud technology, your messages sync automatically, so you can start a conversation on your phone and continue it seamlessly on your laptop without losing context. With end-to-end encryption for secret chats and advanced privacy settings, your personal data remains protected at all times. The app is optimized for performance, capable of delivering messages even on weak internet connections while maintaining exceptional speed and low data consumption. Group chats can host thousands of members, making it perfect for large communities, online classes, or global projects. You can create channels to broadcast updates, share announcements, or build audiences without revealing your personal number. The app's customizable interface, themes, and bots offer endless possibilities for personalization and automation, transforming simple messaging into an interactive experience. Media files are stored safely in the cloud, so you never have to worry about storage space. Regular updates introduce innovative features such as voice chats, video calls, stickers, reactions, and advanced search options that help you find anything instantly. Whether for personal communication, teamwork, or community building, this app combines security, versatility, and lightning-fast performance to keep you connected wherever you are — all while ensuring that your messages, memories, and conversations stay completely under your control.",
    "size": 40,
    "reviews": 2500090,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 200000
      },
      {
        "name": "2 star",
        "count": 350000
      },
      {
        "name": "3 star",
        "count": 900000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 18800000
      }
    ]
  },
  {
    "id": 12,
    "title": "WhatsApp",
    "companyName": "Meta Platforms Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/733/733585.png",
    "description": "Free and secure messaging and calling app trusted by billions of people around the world. This app makes it easy to stay connected with your family, friends, and colleagues through instant text messages, high-quality voice calls, and crystal-clear video chats. Designed with simplicity and reliability in mind, it works seamlessly on both mobile and desktop devices, even with slow network connections. Messages and calls are protected by end-to-end encryption, ensuring that your private conversations remain private and accessible only to you and the person you're communicating with. You can create group chats for family updates, team projects, or event planning, making coordination faster and more convenient. Sharing moments is effortless with features like photo, video, document, and voice message sharing — all delivered instantly with no limits on size or quality. Status updates allow you to share your daily moments in a fun, visual way with your contacts, while message reactions and stickers add emotion and personality to every conversation. The app also supports disappearing messages, providing an extra layer of privacy when you want your chats to be temporary. Backup and sync features ensure your important messages and media are never lost. With regular updates introducing new features, the app continues to evolve to meet the needs of modern communication. Whether you're checking in with loved ones across the street or collaborating with teammates across the globe, this app provides a secure, fast, and dependable way to communicate — all for free, with no ads or subscription fees required.",
    "size": 45,
    "reviews": 1120000,
    "ratingAvg": 4.6,
    "downloads": 700000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 1600000
      },
      {
        "name": "2 star",
        "count": 2500000
      },
      {
        "name": "3 star",
        "count": 5000000
      },
      {
        "name": "4 star",
        "count": 15000000
      },
      {
        "name": "5 star",
        "count": 88000000
      }
    ]
  },
  {
    "id": 13,
    "title": "Discord",
    "companyName": "Discord Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968756.png",
    "description": "Join voice, video, and text chats to connect with your community in a fast, secure, and enjoyable way. This app brings people together around shared interests, games, and goals — whether you're building a study group, managing a gaming squad, or simply staying in touch with friends. You can create or join servers based on your favorite topics, where channels keep conversations organized by subject. Voice chat allows for spontaneous discussions, while video calls make face-to-face meetings more personal and engaging. The app's low-latency technology ensures crystal-clear audio even when thousands of users are online, making it perfect for both casual hangouts and professional collaborations. File sharing, screen sharing, and link embedding make it easy to share memes, documents, or live demos without switching apps. With customizable roles and permissions, community moderators can manage members efficiently and maintain a safe, welcoming space for everyone. Notifications and activity feeds help you stay updated on what's happening, while rich media previews make chatting more interactive. The app also supports integration with popular platforms like Twitch, Spotify, and YouTube, adding an extra layer of social connection. Built with privacy and performance in mind, it offers end-to-end encryption for voice and text communication. Whether on mobile or desktop, this app keeps you connected anytime, anywhere. From gaming clans and study buddies to hobbyist communities and creators' networks, it's more than just a chat app — it's a digital home where meaningful connections thrive and creativity flourishes.",
    "size": 50,
    "reviews": 120000,
    "ratingAvg": 4.8,
    "downloads": 500000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 200000
      },
      {
        "name": "2 star",
        "count": 300000
      },
      {
        "name": "3 star",
        "count": 700000
      },
      {
        "name": "4 star",
        "count": 2000000
      },
      {
        "name": "5 star",
        "count": 8800000
      }
    ]
  },
  {
    "id": 14,
    "title": "Slack",
    "companyName": "Salesforce",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111615.png",
    "description": "Collaborate, communicate, and connect teams efficiently with this all-in-one workplace communication platform designed to make teamwork seamless and productive. The app brings messages, meetings, and files together in one centralized space, reducing the need to switch between multiple tools. Teams can create dedicated channels for projects, departments, or topics, ensuring that discussions remain organized and focused. With real-time messaging, voice calls, and video meetings, communication flows effortlessly whether you're working in the same office or across different time zones. File sharing is instant and secure, allowing teammates to collaborate on documents, presentations, and spreadsheets without delay. Integration with popular productivity tools such as Google Drive, Trello, and Asana enhances workflow efficiency, enabling you to manage tasks and projects directly within the app. Notifications are smartly designed to minimize distractions, helping you stay focused on what matters most. The app's search feature allows you to quickly find messages, shared links, and files, making information retrieval fast and intuitive. Security is a top priority, with enterprise-grade encryption and admin controls that keep company data safe. Customizable themes, emojis, and bots bring personality and automation to team communication, making daily collaboration enjoyable and efficient. Whether you're managing a startup, running a classroom, or leading a global organization, this platform adapts to your team's unique needs and scale. It transforms how people work together by promoting transparency, accountability, and real-time collaboration, helping your team achieve more in less time.",
    "size": 55,
    "reviews": 400890,
    "ratingAvg": 4.5,
    "downloads": 900000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 100000
      },
      {
        "name": "2 star",
        "count": 200000
      },
      {
        "name": "3 star",
        "count": 800000
      },
      {
        "name": "4 star",
        "count": 3000000
      },
      {
        "name": "5 star",
        "count": 4900000
      }
    ]
  },
  {
    "id": 15,
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111620.png",
    "description": "Video conferencing and collaboration for work, school, and personal use have never been easier with this powerful communication platform. Designed for seamless virtual interaction, it enables users to host or join high-quality meetings, webinars, and video calls from anywhere in the world. Whether you're connecting with colleagues, attending online classes, or catching up with friends and family, this app provides crystal-clear video, smooth audio, and low-latency performance even on slower networks. It supports features like screen sharing, file transfer, live chat, and breakout rooms, allowing teams and students to work together efficiently. The intuitive interface ensures that anyone can join a meeting with just a single click, no technical expertise required. Advanced collaboration tools—such as virtual whiteboards, real-time document editing, and meeting recordings—help participants stay productive and organized. Security is a top priority, with end-to-end encryption, meeting locks, and password protection to keep your conversations private and safe. The app also offers smart scheduling integration with calendars and reminders, ensuring you never miss an important session. Users can customize their backgrounds, use filters, or enable noise suppression to maintain a professional environment. With options for large-scale conferences, online events, and classroom sessions, it's built to handle both casual chats and enterprise-level communication. Whether you're working remotely, studying online, or connecting socially, this video conferencing app bridges distances and brings people closer together through reliable, real-time communication.",
    "size": 60,
    "reviews": 580000,
    "ratingAvg": 4.4,
    "downloads": 100000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 600000
      },
      {
        "name": "2 star",
        "count": 1000000
      },
      {
        "name": "3 star",
        "count": 4000000
      },
      {
        "name": "4 star",
        "count": 15000000
      },
      {
        "name": "5 star",
        "count": 37400000
      }
    ]
  },
  {
    "id": 16,
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111589.png",
    "description": "Dive into discussions, memes, and trending communities around the world with an app built for curiosity, creativity, and conversation. Whether you're passionate about technology, movies, gaming, art, science, or everyday humor, this platform connects millions of people who share your interests. You can explore thousands of vibrant communities where people post stories, share experiences, and engage in lively debates on almost any topic imaginable. Each community has its own unique culture and tone, allowing you to find spaces that match your personality and values. From breaking news to wholesome memes, deep advice to lighthearted jokes, you can discover what's happening right now and be part of the global conversation. The app's upvote and comment system makes it easy to see what others value most while giving you the chance to express your voice and perspective. Personalized feeds adapt to your browsing habits, so you always see posts that align with your interests. Notifications ensure you never miss replies, trending topics, or community updates. You can also share your own content, start discussions, or build a following of like-minded users. With advanced moderation tools and reporting options, communities stay safe, respectful, and fun. Dark mode, intuitive navigation, and quick search features make the app enjoyable and easy to use at any time of day. Whether you're looking to learn something new, laugh out loud, or connect with others, this community-driven platform keeps you informed, entertained, and inspired every day.",
    "size": 55,
    "reviews": 200078,
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 200000
      },
      {
        "name": "2 star",
        "count": 350000
      },
      {
        "name": "3 star",
        "count": 1000000
      },
      {
        "name": "4 star",
        "count": 3000000
      },
      {
        "name": "5 star",
        "count": 15600000
      }
    ]
  },
  {
    "id": 17,
    "title": "Trello",
    "companyName": "Atlassian",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111670.png",
    "description": "Manage tasks, organize projects, and boost team productivity with Trello boards — your ultimate visual workspace for staying on top of everything. This app helps individuals, teams, and businesses plan, track, and execute projects in an intuitive, drag-and-drop interface. With boards, lists, and cards, you can break down complex goals into manageable tasks and visualize your progress from start to finish. Each card can include descriptions, checklists, due dates, attachments, and comments, ensuring that every detail of your workflow stays organized and easy to follow. Real-time collaboration lets multiple users work together seamlessly, with instant updates that keep everyone on the same page. You can assign tasks, tag teammates, and track deadlines effortlessly, reducing confusion and improving accountability across the team. Trello boards integrate smoothly with popular tools like Slack, Google Drive, and Jira, allowing you to centralize your work in one place. Whether you're managing marketing campaigns, product development, or personal goals, this app adapts to your workflow. Smart automation powered by built-in bots reduces repetitive actions, saving you valuable time. The clean, minimal interface promotes focus while still offering deep customization through themes, labels, and power-ups. Notifications and reminders ensure that no task slips through the cracks. Even offline, you can continue organizing your projects, and everything syncs automatically when you reconnect. With its combination of flexibility, simplicity, and power, this task management tool turns chaos into clarity, helping teams collaborate efficiently and achieve goals faster than ever.",
    "size": 40,
    "reviews": 40000,
    "ratingAvg": 4.7,
    "downloads": 20000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 30000
      },
      {
        "name": "2 star",
        "count": 80000
      },
      {
        "name": "3 star",
        "count": 200000
      },
      {
        "name": "4 star",
        "count": 1000000
      },
      {
        "name": "5 star",
        "count": 2700000
      }
    ]
  },
  {
    "id": 18,
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "image": "https://cdn-icons-png.flaticon.com/512/10948/10948441.png",
    "description": "Your personal AI assistant for writing, learning, and productivity — built to help you think, create, and achieve more in less time. This intelligent companion assists you in writing emails, essays, blogs, and professional reports effortlessly. Whether you're drafting creative stories, preparing study notes, or summarizing long documents, the AI understands your context and delivers precise, polished results. You can ask questions, brainstorm ideas, or get instant explanations for complex topics, making it an essential learning tool for students, researchers, and professionals alike. With smart grammar correction, tone adjustment, and sentence rephrasing, your writing becomes clearer, more confident, and perfectly tailored to your audience. The app also supports multilingual translation and text expansion, helping users communicate seamlessly across languages. Built-in templates simplify common tasks such as resume writing, marketing copy, or meeting summaries. Its clean, distraction-free interface ensures smooth workflow and focus, while dark mode and voice input make long writing sessions more comfortable. Everything is automatically saved to the cloud, so your work is accessible anytime, anywhere, on any device. Advanced privacy settings keep your conversations secure and confidential. Integrated task and note management features help you stay organized, while AI reminders suggest what to focus on next. Regular updates bring new writing styles, creative prompts, and improved personalization. Whether you're working, studying, or just exploring new ideas, this AI assistant adapts to your needs and grows smarter with every interaction — transforming the way you write, learn, and create every day.",
    "size": 60,
    "reviews": 1500000,
    "ratingAvg": 4.9,
    "downloads": 1000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 20000
      },
      {
        "name": "2 star",
        "count": 40000
      },
      {
        "name": "3 star",
        "count": 90000
      },
      {
        "name": "4 star",
        "count": 800000
      },
      {
        "name": "5 star",
        "count": 14000000
      }
    ]
  },
  {
    "id": 19,
    "title": "Adobe Express",
    "companyName": "Adobe Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968520.png",
    "description": "Design stunning graphics, videos, and collages on the go with this all-in-one creative design app built for everyone — from beginners to professionals. Whether you're crafting a social media post, a business presentation, or a personal project, this app gives you powerful yet intuitive tools right at your fingertips. Choose from thousands of customizable templates designed for Instagram, YouTube, TikTok, and more. Edit photos, apply filters, add stylish text, and insert animations or transitions effortlessly. The drag-and-drop interface makes it easy to build professional-quality designs without needing advanced technical skills. With built-in video editing, you can trim clips, add background music, layer text, and adjust brightness or contrast with precision. The app also includes a smart resize feature, letting you instantly adapt your design for different platforms. Collaborate with team members in real time — share projects, leave comments, and edit together seamlessly. You can upload your own assets or access a massive library of free and premium images, icons, shapes, and fonts. Cloud sync ensures your work is automatically saved and accessible across devices, so you can start designing on your phone and finish on your tablet or desktop. Export your creations in multiple formats, including high-resolution images and MP4 videos, ready to share instantly. Whether you're creating marketing materials, invitations, or artistic content, this app empowers creativity anytime, anywhere. With continuous updates and AI-powered design suggestions, it helps you stay inspired and produce eye-catching visuals that truly stand out.",
    "size": 75,
    "reviews": 60000,
    "ratingAvg": 4.6,
    "downloads": 50000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 70000
      },
      {
        "name": "2 star",
        "count": 100000
      },
      {
        "name": "3 star",
        "count": 250000
      },
      {
        "name": "4 star",
        "count": 1200000
      },
      {
        "name": "5 star",
        "count": 4200000
      }
    ]
  },
  {
    "id": 20,
    "title": "VS Code Mobile",
    "companyName": "Microsoft",
    "image": "https://cdn-icons-png.flaticon.com/512/906/906324.png",
    "description": "Connect with professionals, find jobs, and grow your career network in one trusted platform built for meaningful opportunities. This app helps you showcase your skills, achievements, and experience to attract employers and collaborators around the world. Create a personalized profile to highlight your education, work history, and professional interests, then start connecting with people in your industry. Whether you are seeking your next job, hiring talent, or exploring new business ideas, this platform makes professional networking fast, simple, and effective. Discover millions of companies, recruiters, and mentors offering insights and opportunities tailored to your goals. The app also provides daily updates, industry news, and learning resources to help you stay informed and competitive. Through smart job recommendations powered by AI, you can find positions that match your qualifications and apply with a single tap. Participate in discussions, join groups, and share your thoughts to build credibility and grow your influence. With built-in messaging, video calling, and virtual event tools, you can communicate easily with peers or potential employers. The app also includes advanced analytics to show how your profile performs and who's viewing it. Designed with security and privacy in mind, it ensures your professional data remains protected. Whether you're a student, entrepreneur, freelancer, or executive, this app empowers you to take control of your career path. Grow your connections, expand your reach, and open doors to global opportunities — all within one professional network that's redefining the way the world works and collaborates.",
    "size": 85,
    "reviews": 370000,
    "ratingAvg": 4.8,
    "downloads": 28000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 20000
      },
      {
        "name": "2 star",
        "count": 40000
      },
      {
        "name": "3 star",
        "count": 100000
      },
      {
        "name": "4 star",
        "count": 600000
      },
      {
        "name": "5 star",
        "count": 2700000
      }
    ]
  },
  {
    "id": 21,
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111532.png",
    "description": "Connect with professionals, find jobs, and grow your career network in one trusted platform built for meaningful opportunities. This app helps you showcase your skills, achievements, and experience to attract employers and collaborators around the world. Create a personalized profile to highlight your education, work history, and professional interests, then start connecting with people in your industry. Whether you are seeking your next job, hiring talent, or exploring new business ideas, this platform makes professional networking fast, simple, and effective. Discover millions of companies, recruiters, and mentors offering insights and opportunities tailored to your goals. The app also provides daily updates, industry news, and learning resources to help you stay informed and competitive. Through smart job recommendations powered by AI, you can find positions that match your qualifications and apply with a single tap. Participate in discussions, join groups, and share your thoughts to build credibility and grow your influence. With built-in messaging, video calling, and virtual event tools, you can communicate easily with peers or potential employers. The app also includes advanced analytics to show how your profile performs and who's viewing it. Designed with security and privacy in mind, it ensures your professional data remains protected. Whether you're a student, entrepreneur, freelancer, or executive, this app empowers you to take control of your career path. Grow your connections, expand your reach, and open doors to global opportunities — all within one professional network that's redefining the way the world works and collaborates.",
    "size": 60,
    "reviews": 280000,
    "ratingAvg": 4.5,
    "downloads": 18000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 500000
      },
      {
        "name": "2 star",
        "count": 700000
      },
      {
        "name": "3 star",
        "count": 2000000
      },
      {
        "name": "4 star",
        "count": 6000000
      },
      {
        "name": "5 star",
        "count": 19000000
      }
    ]
  },
  {
    "id": 22,
    "title": "Twitter (X)",
    "companyName": "X Corp.",
    "image": "https://cdn-icons-png.flaticon.com/512/733/733579.png",
    "description": "Join global conversations and share your voice with the world through this dynamic microblogging and social platform. Designed for open communication and instant interaction, it lets you express your thoughts, ideas, and opinions in real time. You can post short updates, photos, videos, and links to spark discussions and connect with millions of users around the world. The app promotes authentic engagement by enabling users to follow topics, hashtags, and people they care about. With a personalized timeline, you'll always stay informed about what matters most to you — from breaking news and global events to entertainment, sports, and technology. Real-time notifications keep you updated on replies, mentions, and trending topics. Whether you're a content creator, journalist, or casual user, the app gives you a platform to build your voice and grow your audience. Its algorithm ensures you discover relevant content, while advanced moderation tools keep your experience safe and positive. You can also create polls, share live broadcasts, or engage through direct messages for deeper conversations. Verified profiles and community guidelines help maintain trust and authenticity across the network. The app is optimized for performance, delivering smooth scrolling, instant refresh, and lightweight data use even on slower connections. It's more than a social platform — it's where ideas spread, movements begin, and communities form. With this app, every voice counts, every opinion matters, and every moment has the potential to reach the world.",
    "size": 55,
    "reviews": 95000,
    "ratingAvg": 4.2,
    "downloads": 100000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 4000000
      },
      {
        "name": "3 star",
        "count": 8000000
      },
      {
        "name": "4 star",
        "count": 20000000
      },
      {
        "name": "5 star",
        "count": 61000000
      }
    ]
  },
  {
    "id": 23,
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111708.png",
    "description": "This social media app lets you share moments instantly, express yourself creatively, and stay connected with the people who matter most. With powerful photo and video sharing features, you can post snapshots of your daily life, upload stories that disappear after 24 hours, or share longer videos on your profile to build your digital identity. The app offers a wide range of filters, effects, and editing tools to enhance your photos and videos, helping you create content that truly stands out. You can follow friends, influencers, and brands, explore trending topics, and discover content tailored to your interests through a smart recommendation system. Real-time messaging allows you to chat privately, send disappearing photos, and even start video calls with your close friends. Push notifications ensure you never miss updates, likes, or comments on your posts. With strong privacy controls, you can decide who sees your content and manage your interactions with ease. The app also includes a built-in analytics feature for creators, allowing them to track engagement and grow their audience. Whether you're documenting your travels, promoting your business, or just sharing everyday highlights, this platform gives you the freedom to connect and be seen. Designed for speed, simplicity, and fun, it's your space to explore, express, and engage with a vibrant global community in real time.",
    "size": 60,
    "reviews": 67000,
    "ratingAvg": 4.3,
    "downloads": 100000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 1000000
      },
      {
        "name": "2 star",
        "count": 1500000
      },
      {
        "name": "3 star",
        "count": 4000000
      },
      {
        "name": "4 star",
        "count": 10000000
      },
      {
        "name": "5 star",
        "count": 51500000
      }
    ]
  },
  {
    "id": 24,
    "title": "Google Maps",
    "companyName": "Google LLC",
    "image": "https://cdn-icons-png.flaticon.com/512/2991/2991231.png",
    "description": "This advanced navigation app helps you explore the world effortlessly with real-time GPS tracking, live traffic updates, and detailed transit information. Whether you're driving, cycling, or walking, it provides precise turn-by-turn directions, ensuring you always reach your destination efficiently. The app intelligently adapts to traffic conditions, suggesting faster alternative routes when congestion occurs, saving you both time and fuel. Public transport users can view accurate schedules, bus and train routes, and estimated arrival times in real time. Offline maps allow you to navigate even when there's no internet connection, making it ideal for travelers and adventurers exploring remote locations. With voice-guided navigation, you can keep your eyes on the road while receiving clear, step-by-step instructions. The app also highlights nearby points of interest, such as gas stations, restaurants, ATMs, and hotels, helping you plan your trips more conveniently. Smart features like lane guidance, speed limit alerts, and accident notifications make driving safer and more comfortable. You can also share your live location with friends and family for extra safety. Personalized recommendations and travel history allow you to revisit your favorite places easily. Designed with a clean interface and smooth performance, this GPS app turns every journey into a seamless experience. Whether you're commuting daily or exploring new destinations, it keeps you connected, informed, and in control every step of the way.",
    "size": 90,
    "reviews": 250000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 3000000
      },
      {
        "name": "3 star",
        "count": 5000000
      },
      {
        "name": "4 star",
        "count": 20000000
      },
      {
        "name": "5 star",
        "count": 220000000
      }
    ]
  },
  {
    "id": 25,
    "title": "Google Photos",
    "companyName": "Google LLC",
    "image": "https://cdn-icons-png.flaticon.com/512/300/300221.png",

    "description": "This intelligent photo management app lets you store, organize, and back up all your pictures securely in the cloud. Designed for simplicity and reliability, it ensures that your precious memories are always safe, accessible, and beautifully organized. Every photo you take is automatically uploaded to your personal cloud storage, freeing up space on your device while keeping your data protected. With powerful AI-powered search, you can instantly find images by typing keywords, dates, locations, or even by describing what's in the picture — like 'birthday cake' or 'beach sunset'. The app automatically categorizes your photos into albums based on events, people, and locations, so you can relive your favorite moments with ease. Its smart editing tools allow you to enhance colors, adjust lighting, and remove unwanted objects in just a few taps. You can also create collages, slideshows, and short movies to share with friends and family. The built-in sharing options make it easy to send photos privately or publish them on social media in high quality. For added peace of mind, the app features end-to-end encryption and two-step verification, ensuring your photos remain private and protected at all times. Whether you're a traveler capturing adventures, a parent preserving family memories, or a photographer managing thousands of shots, this app keeps your photo library organized, safe, and effortlessly accessible — anytime, anywhere.",
    "size": 85,
    "reviews": 1200000,
    "ratingAvg": 4.6,
    "downloads": 5000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 1000000
      },
      {
        "name": "2 star",
        "count": 2000000
      },
      {
        "name": "3 star",
        "count": 4000000
      },
      {
        "name": "4 star",
        "count": 12000000
      },
      {
        "name": "5 star",
        "count": 101000000
      }
    ]
  },
  {
    "id": 26,
    "title": "Grammarly",
    "companyName": "Grammarly Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968893.png",
    "description": "This AI-powered writing assistant helps you write clearly, confidently, and effectively in any situation. Whether you're drafting an email, writing an essay, creating content, or chatting online, it provides real-time grammar, spelling, and punctuation corrections that enhance your writing quality. Beyond basic checks, the app analyzes your tone, clarity, and word choice to ensure your message sounds natural and professional. It also gives you smart suggestions to simplify complex sentences, eliminate redundancy, and improve readability, helping your writing flow smoothly from start to finish. With advanced AI models trained on diverse linguistic data, the assistant adapts to different writing styles — from formal reports to casual messages — and offers tailored advice to fit your communication goals. You can set specific intents, like informing, persuading, or describing, and it will automatically adjust your phrasing accordingly. The app syncs across devices, so your writing improvements follow you whether you're on mobile, desktop, or browser. Security and privacy are top priorities, ensuring that your texts remain confidential and protected. It's perfect for students, professionals, and content creators who want to make their writing sharper and more engaging without losing their personal touch. With this tool, you don't just correct mistakes — you develop stronger writing habits and express your ideas with clarity and confidence every time you type.",
    "size": 50,
    "reviews": 70000,
    "ratingAvg": 4.8,
    "downloads": 100000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 30000
      },
      {
        "name": "2 star",
        "count": 70000
      },
      {
        "name": "3 star",
        "count": 200000
      },
      {
        "name": "4 star",
        "count": 1000000
      },
      {
        "name": "5 star",
        "count": 5700000
      }
    ]
  },
  {
    "id": 27,
    "title": "PayPal",
    "companyName": "PayPal Holdings",
    "image": "https://cdn-icons-png.flaticon.com/512/174/174861.png",
    "description": "PayPal is one of the world's most trusted digital payment platforms, designed to make sending, receiving, and managing money fast, simple, and secure. Whether you're shopping online, paying for services, or transferring money to friends and family, PayPal ensures that every transaction is protected by industry-leading encryption and fraud prevention technology. With just your email address and password, you can pay on millions of websites without needing to share your financial details. This makes PayPal not only convenient but also incredibly safe for both buyers and sellers. Businesses around the globe rely on PayPal for seamless transactions, automatic currency conversion, and easy integration with e-commerce stores. The mobile app provides a clear overview of your balance, recent payments, and linked bank accounts or cards, so you're always in control of your money. You can send payments instantly, request funds, split bills, or donate to causes that matter to you — all within seconds. PayPal also offers buyer protection, ensuring you get refunds if your purchase doesn't match the description or fails to arrive. For freelancers and small business owners, it simplifies invoicing and international payments, supporting over 200 countries and multiple currencies. With tools for budgeting, saving, and digital receipts, PayPal is more than just a payment app — it's your secure digital wallet that keeps your finances organized and your transactions stress-free, wherever you go.",

    "size": 45,
    "reviews": 110000,
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 100000
      },
      {
        "name": "2 star",
        "count": 200000
      },
      {
        "name": "3 star",
        "count": 600000
      },
      {
        "name": "4 star",
        "count": 3000000
      },
      {
        "name": "5 star",
        "count": 7500000
      }
    ]
  },
  {
    "id": 28,
    "title": "Dropbox",
    "companyName": "Dropbox Inc.",
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968691.png",
    "description": "Google Drive is a reliable and secure cloud storage service that allows you to store, share, and access your files from anywhere with an internet connection. Whether you are working on a school project, managing office documents, or keeping personal memories safe, Google Drive provides a simple yet powerful way to organize your digital life. You can easily upload photos, videos, PDFs, spreadsheets, and presentations, and all of them remain synchronized across your devices — phone, tablet, or computer. Every change you make is instantly saved and backed up in the cloud, ensuring that your files are never lost. One of the biggest strengths of Google Drive is collaboration. Multiple people can edit the same document in real time, leave comments, and track changes, which makes teamwork faster and more productive. Integrated with Google Docs, Sheets, and Slides, it offers a seamless workspace for both individuals and teams. Drive also provides smart search powered by Google AI, helping you find files quickly by keyword or even image content. Security is at the core of Google Drive, with advanced encryption, privacy controls, and two-step verification protecting your data from unauthorized access. You can control who sees your files and for how long. Offline access means you can continue working even without an internet connection, and everything syncs automatically when you reconnect. With generous free storage and affordable upgrades, Google Drive is the perfect solution for storing everything that matters — safely, efficiently, and conveniently in one place.",

    "size": 60,
    "reviews": 85000,
    "ratingAvg": 4.4,
    "downloads": 1000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 150000
      },
      {
        "name": "2 star",
        "count": 250000
      },
      {
        "name": "3 star",
        "count": 900000
      },
      {
        "name": "4 star",
        "count": 2000000
      },
      {
        "name": "5 star",
        "count": 5200000
      }
    ]
  },
  {
    "id": 29,
    "title": "Spotify Lite",
    "companyName": "Spotify AB",
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111624.png",
    "description": "Spotify Lite is a streamlined and lightweight version of the popular Spotify app, designed for users who want to enjoy millions of songs and podcasts without consuming too much storage space or mobile data. Built specifically for devices with limited memory or slower internet connections, Spotify Lite retains the essence of the original Spotify experience — high-quality streaming, personalized playlists, and global music discovery — but in a more efficient package. With this app, you can explore your favorite artists, albums, and playlists with faster loading times and smoother navigation, even on low-end Android devices. Spotify Lite provides users with full control over their data usage. You can set a data limit to ensure you never exceed your plan, monitor how much you've used, and manage downloads efficiently. The app interface is clean and intuitive, focusing on simplicity and performance. It also adapts to different network conditions, maintaining playback stability whether you're on Wi-Fi or mobile data. In addition to streaming, Spotify Lite allows users to find trending songs, follow artists, and discover new music from around the world. It's perfect for travel, work, study, or relaxation — anywhere you need your favorite tunes without worrying about data consumption or device performance. Despite its smaller size, Spotify Lite still delivers a rich, immersive listening experience that brings people closer to the music they love — anytime, anywhere, with minimal effort.",

    "size": 15,
    "reviews": 500000,
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 30000
      },
      {
        "name": "2 star",
        "count": 50000
      },
      {
        "name": "3 star",
        "count": 200000
      },
      {
        "name": "4 star",
        "count": 1000000
      },
      {
        "name": "5 star",
        "count": 3700000
      }
    ]
  },
  {
    "id": 30,
    "title": "Google Drive",
    "companyName": "Google LLC",
    "image": "https://cdn-icons-png.flaticon.com/512/2991/2991148.png",
    "description": "Google Drive is a powerful cloud storage platform that allows users to store, share, and collaborate on files securely from anywhere. It is designed for individuals, professionals, and organizations, providing a reliable solution for managing digital content. Users can store documents, images, videos, spreadsheets, and presentations, and access them easily from any device connected to the internet. One of Google Drive's greatest advantages is real-time collaboration — multiple people can work on the same file simultaneously, make edits, leave comments, and track changes instantly, which greatly enhances team productivity. Its seamless integration with Google Docs, Sheets, and Slides makes workflow faster and more efficient. Google Drive also emphasizes strong security, using advanced encryption and privacy controls to ensure that files remain protected. The offline access feature allows users to view and edit files even without an internet connection, automatically syncing changes once they're back online. With fast file sharing, smart search functionality, and the ability to upload large files, it has become one of the most popular and convenient cloud storage services worldwide. Whether for education, business, or personal use, Google Drive simplifies daily work, promotes collaboration, and provides a safe, organized space for all your important digital files.",
    "size": 85,
    "reviews": 200000,
    "ratingAvg": 4.8,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 177000000 }
    ]
  }
]
